---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.Format
source: html/b0762e23-5c49-42bf-b3cc-d0b1194543c9.htm
---
# Autodesk.Revit.DB.BasicFileInfo.Format Property

The file format indicator (currently, the major release version such as "2019") used for saving the file.

## Syntax (C#)
```csharp
public string Format { get; }
```